[
    {
        "id": 1,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-1.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Flush belly fat overnight with our secret herbal tonic, featured in Wellness Weekly!",
                "phrases": [
                    {
                        "text": "Flush belly fat overnight",
                        "flag": "red",
                        "explanation": "This is a red flag because it promises a specific outcome in a short timeframe (Rule 2, 10).",
                        "correct_feedback": "Correct! This is a red flag due to its exaggerated and unrealistic claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it promises unrealistic results."
                    },
                    {
                        "text": "secret herbal tonic",
                        "flag": "red",
                        "explanation": "This is a red flag because it appeals to secrecy without evidence (Rule 6).",
                        "correct_feedback": "Correct! This is a red flag due to its appeal to secrecy.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it lacks evidence."
                    },
                    {
                        "text": "featured in Wellness Weekly",
                        "flag": "neutral",
                        "explanation": "This is a neutral statement as it is merely a source mention and not evaluative.",
                        "correct_feedback": "Correct! This is a neutral statement with no evaluative content.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement."
                    }
                ],
                "explanation": "This statement contains exaggerated promises and appeals to secrecy, but the source mention is neutral."
            }
        ]
    },
    {
        "id": 2,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-2.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Resistance training helps improve insulin sensitivity over time when paired with consistent nutrition.",
                "phrases": [
                    {
                        "text": "Resistance training helps improve insulin sensitivity",
                        "flag": "green",
                        "explanation": "This is a green flag because it specifies a mechanism supported by evidence (Rule 1).",
                        "correct_feedback": "Correct! This is a green flag because it is specific and evidence-based.",
                        "incorrect_feedback": "Incorrect. This is a green flag due to its specificity and evidence."
                    },
                    {
                        "text": "over time",
                        "flag": "green",
                        "explanation": "This is a green flag because it acknowledges gradual improvement (Rule 11).",
                        "correct_feedback": "Correct! This is a green flag because it emphasizes gradual change.",
                        "incorrect_feedback": "Incorrect. This is a green flag because it highlights realistic progress."
                    },
                    {
                        "text": "consistent nutrition",
                        "flag": "neutral",
                        "explanation": "This is neutral because it is vague but not misleading.",
                        "correct_feedback": "Correct! This is a neutral statement as it is not inherently misleading.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement."
                    }
                ],
                "explanation": "This statement emphasizes evidence-based mechanisms and gradual improvement while being vague about nutrition."
            }
        ]
    },
    {
        "id": 3,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-3.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "This one mushroom cured my anxiety forever. I also started meditating more.",
                "phrases": [
                    {
                        "text": "one mushroom cured my anxiety forever",
                        "flag": "red",
                        "explanation": "This is a red flag because it suggests a single ingredient can cure a complex mental health condition (Rule 7, 9).",
                        "correct_feedback": "Correct! This is a red flag due to its oversimplified and unsupported claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it is unrealistic and unsupported."
                    },
                    {
                        "text": "I also started meditating more",
                        "flag": "neutral",
                        "explanation": "This is neutral as it is a supplemental behavior and not inherently misleading.",
                        "correct_feedback": "Correct! This is a neutral statement that adds context without making a claim.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement."
                    }
                ],
                "explanation": "This statement contains a red flag for oversimplified cure claims but neutral context for supplemental behaviors."
            }
        ]
    },
    {
        "id": 4,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-4.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Used for centuries, acupuncture is still debated today. Some say it helps them relax.",
                "phrases": [
                    {
                        "text": "Used for centuries",
                        "flag": "red",
                        "explanation": "This is a red flag because it appeals to tradition without evidence (Rule 6).",
                        "correct_feedback": "Correct! This is a red flag due to its appeal to tradition without evidence.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it lacks supporting evidence."
                    },
                    {
                        "text": "Some say it helps them relax",
                        "flag": "neutral",
                        "explanation": "This is neutral as it is anecdotal and vague but not false.",
                        "correct_feedback": "Correct! This is a neutral statement due to its anecdotal nature.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement."
                    },
                    {
                        "text": "acupuncture is still debated today",
                        "flag": "green",
                        "explanation": "This is a green flag because it acknowledges complexity and debate (Rule 3).",
                        "correct_feedback": "Correct! This is a green flag for acknowledging complexity.",
                        "incorrect_feedback": "Incorrect. This is a green flag because it promotes balanced understanding."
                    }
                ],
                "explanation": "This statement includes appeals to tradition, vague anecdotes, and balanced acknowledgment of complexity."
            }
        ]
    },
    {
        "id": 5,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-5.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Therapy didn’t work for me, but fixing my gut made everything better. I also joined a support group.",
                "phrases": [
                    {
                        "text": "fixing my gut made everything better",
                        "flag": "red",
                        "explanation": "This is a red flag because it makes an overstatement about gut health (Rule 7).",
                        "correct_feedback": "Correct! This is a red flag due to its exaggerated claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it is an overstatement."
                    },
                    {
                        "text": "Therapy didn’t work for me",
                        "flag": "neutral",
                        "explanation": "This is neutral as it is a personal story and not generalized.",
                        "correct_feedback": "Correct! This is a neutral statement as it is a personal experience.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement."
                    },
                    {
                        "text": "I also joined a support group",
                        "flag": "green",
                        "explanation": "This is a green flag as it promotes seeking support and does not discourage professional help (Rule 8).",
                        "correct_feedback": "Correct! This is a green flag as it encourages supportive behavior.",
                        "incorrect_feedback": "Incorrect. This is a green flag because it promotes seeking help."
                    }
                ],
                "explanation": "This statement includes overstatements, personal experiences, and encouragement of support-seeking behavior."
            }
        ]
    },
    {
        "id": 6,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-6.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Collagen supplements support skin health by promoting fibroblast activity. Many users enjoy the taste.",
                "phrases": [
                    {
                        "text": "support skin health by promoting fibroblast activity",
                        "flag": "green",
                        "explanation": "This is a green flag because it specifies a biological mechanism (Rule 1).",
                        "correct_feedback": "Correct! This is a green flag because it provides an evidence-based mechanism.",
                        "incorrect_feedback": "Incorrect. This is a green flag due to its specific and evidence-based claim."
                    },
                    {
                        "text": "Many users enjoy the taste",
                        "flag": "neutral",
                        "explanation": "This is neutral because it is not a health claim.",
                        "correct_feedback": "Correct! This is a neutral statement because it is subjective and not misleading.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement as it is not a health claim."
                    }
                ],
                "explanation": "This statement includes an evidence-based mechanism and a subjective opinion, which is neutral."
            }
        ]
    },
    {
        "id": 7,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-7.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "One spoon of chia seeds a day keeps hormones in check. I sprinkle them on my oatmeal.",
                "phrases": [
                    {
                        "text": "keeps hormones in check",
                        "flag": "red",
                        "explanation": "This is a red flag because it oversimplifies a cure claim (Rule 9).",
                        "correct_feedback": "Correct! This is a red flag due to its oversimplified and unsupported claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it exaggerates health effects."
                    },
                    {
                        "text": "I sprinkle them on my oatmeal",
                        "flag": "neutral",
                        "explanation": "This is neutral as it describes a behavior and does not make a health claim.",
                        "correct_feedback": "Correct! This is a neutral statement as it is a simple behavior description.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement because it is not a health claim."
                    }
                ],
                "explanation": "This statement includes an exaggerated claim and a neutral behavioral description."
            }
        ]
    },
    {
        "id": 8,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-8.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "In just 5 days, I lost 10 pounds with this tea. It also helped me drink more water.",
                "phrases": [
                    {
                        "text": "In just 5 days, I lost 10 pounds",
                        "flag": "red",
                        "explanation": "This is a red flag because it promises a specific outcome in a short timeframe (Rule 2, 11).",
                        "correct_feedback": "Correct! This is a red flag due to its unrealistic timeframe claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it is an exaggerated claim."
                    },
                    {
                        "text": "with this tea",
                        "flag": "red",
                        "explanation": "This is a red flag because it ties a health promise directly to a product (Rule 4).",
                        "correct_feedback": "Correct! This is a red flag because it promotes the tea with unrealistic claims.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it is a product tie-in."
                    },
                    {
                        "text": "helped me drink more water",
                        "flag": "neutral",
                        "explanation": "This is neutral because it describes a plausible effect without exaggeration.",
                        "correct_feedback": "Correct! This is a neutral statement as it is a plausible effect.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement because it is not misleading."
                    }
                ],
                "explanation": "This statement contains exaggerated claims and a plausible behavioral effect."
            }
        ]
    },
    {
        "id": 9,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-9.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "Fasting helped me regulate my blood sugar, but I’d recommend checking with your doctor first.",
                "phrases": [
                    {
                        "text": "Fasting helped me regulate my blood sugar",
                        "flag": "green",
                        "explanation": "This is a green flag because it specifies a biological mechanism (Rule 1).",
                        "correct_feedback": "Correct! This is a green flag because it provides an evidence-based mechanism.",
                        "incorrect_feedback": "Incorrect. This is a green flag due to its specific and evidence-based claim."
                    },
                    {
                        "text": "recommend checking with your doctor first",
                        "flag": "green",
                        "explanation": "This is a green flag because it promotes professional guidance (Rule 8).",
                        "correct_feedback": "Correct! This is a green flag as it encourages professional advice.",
                        "incorrect_feedback": "Incorrect. This is a green flag because it supports seeking professional help."
                    }
                ],
                "explanation": "This statement includes an evidence-based mechanism and encourages professional guidance."
            }
        ]
    },
    {
        "id": 10,
        "image_url": "https://raw.githubusercontent.com/nooriak15/health_education/refs/heads/main/frontend/public/post-10.png",
        "interaction_type": "drag_drop",
        "claims": [
            {
                "text": "This Ayurvedic oil resets your metabolism. I love how it smells!",
                "phrases": [
                    {
                        "text": "resets your metabolism",
                        "flag": "red",
                        "explanation": "This is a red flag because it uses vague mechanisms without evidence (Rule 1).",
                        "correct_feedback": "Correct! This is a red flag due to its vague and unsupported claim.",
                        "incorrect_feedback": "Incorrect. This is a red flag because it lacks a specific mechanism."
                    },
                    {
                        "text": "I love how it smells",
                        "flag": "neutral",
                        "explanation": "This is neutral because it expresses subjective preference and does not make a health claim.",
                        "correct_feedback": "Correct! This is a neutral statement as it is subjective and not misleading.",
                        "incorrect_feedback": "Incorrect. This is a neutral statement because it is not a health claim."
                    }
                ],
                "explanation": "This statement contains a vague health claim and a neutral subjective opinion."
            }
        ]
    }
]

